[{"ig_username": "susubc", "Location": "UBC", "Date": "1/27/2024", "Start Time": "11:00", "End Time": "18:00", "Event Title": "SUS Science Olympics", "Event Description": "Join us for an exhilarating day of trivia, debate, hackathons, case competitions, and more. Team up in groups of 4-6 to test your knowledge, creativity, and teamwork, and compete for victory! Ready to showcase your academic prowess? Link in bio to register and"}, {"ig_username": "susubc", "Date": "1/15/2024", "Event Title": "SUS Community Engagement Fair", "Event Description": "The SUS Community Engagement Fair will feature 14 amazing clubs and organizations - swipe through this post to learn more about their causes!", "Start Time": "", "End Time": "", "Location": "N/A"}, {"ig_username": "susubc", "Location": "Abdul Ladha", "Date": "1/15/2024", "Start Time": "", "End Time": "", "Event Title": "UBC SUS Community Engagement Fair", "Event Description": "The Community Engagement Fair is an annual SUS event which brings UBC Science students together to connect over philanthropy, community awareness, and charity. This year's event will be an incredible networking opportunity that you don't want to miss out on. You will have the opportunity"}, {"ig_username": "susubc", "Location": "AMS Great Hall", "Date": "1/12/2024", "Start Time": "", "End Time": "", "Event Title": "Biotechnology Networking night", "Event Description": "The night will consist of a networking portion where you can visit and chat with companies booth such as StemCell, NanoVation and Acuitas! Following that, there will be a panel session and a Q&A session. You may even secure your future co-op position through networking at this event! If that isn't enough"}, {"ig_username": "susubc", "Location": "Abdul Ladha", "Date": "1/11/2024", "Start Time": "", "End Time": "", "Event Title": "(S)US Plant and Puppy Therapy", "Event Description": "Free plants, pot painting, and puppy therapy. RSVP links are on linktree in our bio!"}, {"ig_username": "susubc", "Location": "The Atrium in the AMS Nest", "Date": "1/10/2024", "Start Time": null, "End Time": "", "Event Title": "Amazing Race event", "Event Description": "Come join (S)US for our Amazing Race event happening on January 10th from 12:00 - 4:00 PM at The Atrium in the AMS Nest! Stop by to meet some UBC science clubs, make new friends"}, {"ig_username": "susubc", "Location": "Orchard Commons Room 4074", "Date": "1/16/2024", "Start Time": "", "End Time": "", "Event Title": "Mario Kart Mash", "Event Description": "SUS is bringing you Mario Kart Mash, a Nintendo Switch Mario Kart tournament. Compete in a single-elimination style 100cc Grand Prix tournament, where the top 3 winners will win $50, $30, and $20 Amazon gift cards. We"}, {"ig_username": "susubc", "Location": "Abdul Ladha", "Date": "1/9/2024", "Start Time": "", "End Time": null, "Event Title": "Cozy Movie Night with SUS", "Event Description": "Come join us for a chance to win Cineplex tickets, gift cards, and a projector. We will be providing pizza and delicious snacks. See you there for a night of entertainment and epic prizes!"}, {"ig_username": "ubcdancehorizons", "Location": "Frederic Wood Theatre", "Date": "12/10/2024", "Event Title": "Lights, Camera, Dance Horizons - MYS 2023", "Event Description": "Join us for a dazzling performance on December 10 at the Frederic Wood Theatre. Our mid-year show will take you on a journey through the glitz, glamor, and rhythm of \"La La Land\". From classic films to contemporary blockbusters, DH brings you a celebration of dance, music, and the"}, {"ig_username": "ubcdancehorizons", "Location": "Frederic Wood - 6354 Crescent Rd, Vancouver, BC V6T 1Z2", "Date": "12/10/2023", "Start Time": "", "End Time": "", "Event Title": "2023 Mid Year Show", "Event Description": "Dance Horizons is presenting their 2023 Mid Year Show with the theme \"Lights, Camera, Dance Horizons\". The show will feature performances from the UBC and Vancouver dance"}, {"ig_username": "ubc.dhco", "Location": "NEST 2306/09", "Date": "1/21/2024", "Start Time": "01:00", "End Time": "04:00", "Event Title": "DHCo's first practice", "Event Description": "It's completely open and free for everyone. This is a great chance to experience what our practices are like before committing to the team! We're excited to see y'all there!!"}, {"ig_username": "ubc.dhc", "Location": "Nest 2301", "Date": "1/20/2024", "Start Time": "15:30", "End Time": "18:00", "Event Title": "DHC's term 2 open practice", "Event Description": "Join us for a free practice! EVERYONE is welcome, regardless of if you were on the team last term! We cannot wait to dance with you!! DM us with any questions you have! #ubc #ubcdancehorizons #vancouverdance"}, {"ig_username": "ubcdancehorizons", "Event Description": "Take a look at all of our amazing guest performers for our show - the show is a week from today so make sure you get your tickets fast and support these wonderful dancers! Matinee and Evening lineups are different so make sure to take a good look :)"}, {"ig_username": "ubcaushewe", "Event Description": "We loved seeing all of your beautiful faces and dance moves at our \"Dance the Night Away\" event yesterday—it really SURROUND(ed us in) SOUND?! Special thank you to Dance Horizons UBC for collaborating with us, and to everyone who showed up. All of you were spectacular—this video just confirms it! We have a lot more in stock for our next event in December, so make sure to keep an eye out for some special goodies right before final season! In"}, {"ig_username": "ubcdancehorizons", "Date": "12/5/2024", "Event Title": "Beginner/Intermediate Jazz/Contemporary with Jenn", "Start Time": "15:00", "End Time": "", "Location": "LIFE 26", "Event Description": "Weekly workshop on Monday, December 4th for intermediate/advanced choreography with Bruce."}, {"ig_username": "ubcdancehorizons", "Date": "11/28/2024", "Event Title": "Intermediate/Advanced Choreography with Mollie", "Start Time": "15:00", "End Time": "16:00", "Location": "LIFE 26", "Event Description": "Weekly workshop for intermediate Hip Hop with Judith & Ela. Open to all levels. $3 for members and $5 for non-members."}, {"ig_username": "ubcaushewe", "Location": "2nd Floor, Arts Student Center", "Date": "11/28/2024", "Start Time": "", "End Time": "", "Event Title": "Free Dance Workshop", "Event Description": "Shaking off the midterm stress like never before! AUSHeWe and DH brings you this mind blowing free dance workshop to kick those post-midterm blues away! Who said self-care can't be this much fun? RSVP link in bio. We"}, {"ig_username": "ubcdancehorizons", "Date": "11/20/2024", "Event Title": "Open Choreo with Alina", "Start Time": "15:00", "End Time": "16:00", "Location": "LIFE 26", "Event Description": "Weekly workshop on Monday, November 20th with Alina for Open Choreo at LIFE 26. Time: 3-4PM."}, {"ig_username": "ubcdancehorizons", "Event Title": "Mid-Year Show", "Event Description": "We're searching for an MC to help us with this year's Mid-Year Show and make it one to remember. If you've got the skills to keep the crowd entertained and the energy levels high, don't miss this exciting opportunity. If you are interested, follow the link in our bio for access to the application form and more details about the process.", "Date": "11/13/2024", "End Time": null}, {"ig_username": "ubcvolleyballclub", "Location": "Wesbrook Sand Courts", "Date": "9/7/2024", "Start Time": "12:00", "End Time": "15:00", "Event Title": "Beach Volleyball Event!", "Event Description": "This event is free for members and non-members! The link to RSVP is on our bio!"}, {"ig_username": "ubcvolleyballclub", "Event Title": "UBC Volleyball Club Membership", "Event Description": "We host volleyball events for players of all skill levels—from complete beginner to advanced. To learn more, read our membership description in the Bounce App!"}, {"ig_username": "ubcvolleyballclub", "Location": "Wesbrook Sand Courts", "Date": "9/16/2024", "Start Time": "12:00", "End Time": "15:00", "Event Title": "First Big Event of the Year", "Event Description": "Sign up now for our first big event of the year! Don't miss the chance to play beach volleyball, win amazing prizes, and support an important cause. The event will take place at Wesbrook Sand Courts and will run from 12 PM to 3 PM."}, {"ig_username": "ubcclubvball", "Location": "SRC", "Date": "9/13/2024", "Start Time": "19:30", "End Time": "22:30", "Event Title": "Men's Tryouts", "Event Description": "UBC Volleyball Club Fall Tryouts for Men on September 13, 2024 from 19:30 to 22:30 at SRC. Registration fee is $20 and sign up must be done through the link in our bio!"}, {"ig_username": "ubcvolleyballclub", "Event Description": "We are looking for people that are passionate about planning volleyball events or marketing for volleyball events!", "Date": "4/5/2023", "End Time": "00:00", "Start Time": "00:00"}, {"ig_username": NaN, "Event Title": "Volleyball Competition event", "Event Description": "Congrats to our tournament winners ?? and thank you to all the participants!"}, {"ig_username": "ubcvolleyballclub", "Event Title": "Volleyball Competition", "Location": "UBC", "Event Description": "We're thrilled to announce that our Volleyball Competition event will be sponsored by @bodyenergyclub at UBC. The team that comes 1st in the competition will get a Free Smoothie coupon for each player!"}, {"ig_username": "ubcclubvball", "Location": "Robert F. Osborne Centre", "Date": "4/12/2024", "Start Time": "14:30", "End Time": "16:30", "Event Title": "UBCVC Women's Summer Club Season Tryouts", "Event Description": "Open to all UBC students staying on campus during the next 2 terms. Cost: $15. Register now by clicking the link in our bio."}, {"ig_username": "cogsubc", "Location": "COGS lounge (LIFE 2514)", "Date": "1/8/2024", "Event Title": "Welcome Back Social", "Event Description": "The CSS is excited to kick off the new year and term with a Welcome Back Social this coming Monday! Join us in the COGS lounge (LIFE 2514) for games, snacks, and good company! Don't forget to RSVP through the Linktree in our bio"}, {"ig_username": "cogsubc", "Date": "12/3/2024", "Event Title": "COGS After Grad", "Event Description": "Your hosts Aakanksha and Beth share their insights into the many paths and great opportunities open for COGS alumni after they graduate."}, {"ig_username": "cogsubc", "Location": "LIFE 2514/2532", "Date": "11/30/2024", "Start Time": "", "End Time": "", "Event Title": "CSS Crafts and Games Night", "Event Description": "Join the CSS for a fun night of crafts and games. Craft supplies, snacks, and games will be provided. Take the chance to unwind before finals hit or get a head start making holiday cards and gifts. RSVP through the Linktree in our bio"}, {"ig_username": NaN, "Location": "Online, Zoom link will be sent to everyone who RSVPs.", "Date": "11/23/2023", "Start Time": "18:30", "End Time": "19:30", "Event Title": "Unlocking Opportunities Workshop", "Event Description": "Join us to find out how you can leverage your COGS degree for an easier time finding a job post-graduation. This week at our Unlocking Opportunities Workshop, we'll take a look at different job markets across the world and exploring"}, {"ig_username": "cogsubc", "Location": "Koerner's Pub", "Date": "11/3/2024", "Start Time": "17:00", "End Time": "21:00", "Event Title": "Meet the Profs", "Event Description": "Join the CSS and UNC for our first ever co-hosted Meet The Profs event! Take the opportunity this Friday to connect with professors, faculty, and advisors from a diverse range of disciplines over drinks and conversation at Koerners Pub! This collaboration is bringing together great minds from"}]